Revit 2024 API
RebarBendingDetailType.MultipleValuesIndicatorOption Property
 Identifies the option of how multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }
Visual Basic
Public Property MultipleValuesIndicatorOption As BendingDetailTypeMultipleValuesIndicatorOptions
	Get
	Set
Visual C++
public:
property BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption {
	BendingDetailTypeMultipleValuesIndicatorOptions get ();
	void set (BendingDetailTypeMultipleValuesIndicatorOptions value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace